#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cdktf-team/prebuilt-providers/runs/run-1ysz84A58qyzh32j

Waiting for the plan to start...

Terraform v1.0.4
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
github_repository.repos_cdktfrepositorymanager_repo_9D19EE52: Refreshing state... [id=cdktf-repository-manager]
github_repository.repos_cdktfproviderazurerm_repo_19E06DC3: Refreshing state... [id=cdktf-provider-azurerm]
github_repository.repos_cdktfproviderrandom_repo_448077DE: Refreshing state... [id=cdktf-provider-random]
github_repository.repos_cdktfprovideraws_repo_55F46B23: Refreshing state... [id=cdktf-provider-aws]
github_repository.repos_cdktfprovidergithub_repo_66B8E54A: Refreshing state... [id=cdktf-provider-github]
github_repository.repos_cdktfproviderproject_repo_014C3CE2: Refreshing state... [id=cdktf-provider-project]
github_repository.repos_cdktfproviderdatadog_repo_3C8DEE00: Refreshing state... [id=cdktf-provider-datadog]
github_repository.repos_cdktfproviderexternal_repo_2177D259: Refreshing state... [id=cdktf-provider-external]
github_repository.repos_cdktfproviderkubernetes_repo_D69C3A79: Refreshing state... [id=cdktf-provider-kubernetes]
github_repository.repos_cdktfprovidernull_repo_8A692B1D: Refreshing state... [id=cdktf-provider-null]
github_repository.repos_cdktfprovidergoogle_repo_3D7769E0: Refreshing state... [id=cdktf-provider-google]
github_repository.repos_cdktfproviderdocker_repo_45A47809: Refreshing state... [id=cdktf-provider-docker]
github_actions_secret.repos_ghcommenttoken_secretgithubrepositoryreposcdktfrepositorymanagerrepo9D19EE52nameghcommenttoken_CD3F9953: Refreshing state... [id=cdktf-repository-manager:GH_COMMENT_TOKEN]
github_actions_secret.repos_tfcloudtoken_secretgithubrepositoryreposcdktfrepositorymanagerrepo9D19EE52nametfcloudtoken_5D4B526C: Refreshing state... [id=cdktf-repository-manager:TF_CLOUD_TOKEN]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderrandomrepo448077DEnamenpmtoken_AFDB0F2B: Refreshing state... [id=cdktf-provider-random:NPM_TOKEN]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderrandomrepo448077DEnamenugetapikey_4B72CF6A: Refreshing state... [id=cdktf-provider-random:NUGET_API_KEY]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderrandomrepo448077DEnametwineusername_2B3ED30F: Refreshing state... [id=cdktf-provider-random:TWINE_USER_NAME]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderrandomrepo448077DEnametwinepassword_12957BC9: Refreshing state... [id=cdktf-provider-random:TWINE_PASSWORD]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderazurermrepo19E06DC3namenugetapikey_6D07722B: Refreshing state... [id=cdktf-provider-azurerm:NUGET_API_KEY]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderazurermrepo19E06DC3nametwinepassword_8154E2FB: Refreshing state... [id=cdktf-provider-azurerm:TWINE_PASSWORD]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderazurermrepo19E06DC3namenpmtoken_2DA48D9F: Refreshing state... [id=cdktf-provider-azurerm:NPM_TOKEN]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderazurermrepo19E06DC3nametwineusername_8A23B070: Refreshing state... [id=cdktf-provider-azurerm:TWINE_USER_NAME]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfprovidergithubrepo66B8E54Anamenugetapikey_795BC233: Refreshing state... [id=cdktf-provider-github:NUGET_API_KEY]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfprovidergithubrepo66B8E54Anametwinepassword_1DCE070B: Refreshing state... [id=cdktf-provider-github:TWINE_PASSWORD]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfprovidergithubrepo66B8E54Anametwineusername_15512541: Refreshing state... [id=cdktf-provider-github:TWINE_USER_NAME]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfprovidergithubrepo66B8E54Anamenpmtoken_9B4FF3AD: Refreshing state... [id=cdktf-provider-github:NPM_TOKEN]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderexternalrepo2177D259nametwinepassword_6A27C028: Refreshing state... [id=cdktf-provider-external:TWINE_PASSWORD]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderexternalrepo2177D259namenpmtoken_34906B46: Refreshing state... [id=cdktf-provider-external:NPM_TOKEN]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderexternalrepo2177D259nametwineusername_32C3B16C: Refreshing state... [id=cdktf-provider-external:TWINE_USER_NAME]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderexternalrepo2177D259namenugetapikey_EBF89198: Refreshing state... [id=cdktf-provider-external:NUGET_API_KEY]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderdatadogrepo3C8DEE00namenpmtoken_37AC08DB: Refreshing state... [id=cdktf-provider-datadog:NPM_TOKEN]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderdatadogrepo3C8DEE00namenugetapikey_89F31AB3: Refreshing state... [id=cdktf-provider-datadog:NUGET_API_KEY]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderdatadogrepo3C8DEE00nametwinepassword_1A05B3D4: Refreshing state... [id=cdktf-provider-datadog:TWINE_PASSWORD]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderdatadogrepo3C8DEE00nametwineusername_1A71CA26: Refreshing state... [id=cdktf-provider-datadog:TWINE_USER_NAME]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderkubernetesrepoD69C3A79namenugetapikey_191ADD39: Refreshing state... [id=cdktf-provider-kubernetes:NUGET_API_KEY]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderkubernetesrepoD69C3A79namenpmtoken_7B3206A5: Refreshing state... [id=cdktf-provider-kubernetes:NPM_TOKEN]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderkubernetesrepoD69C3A79nametwineusername_95CF5E46: Refreshing state... [id=cdktf-provider-kubernetes:TWINE_USER_NAME]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfprovidernullrepo8A692B1Dnamenugetapikey_369EDCA6: Refreshing state... [id=cdktf-provider-null:NUGET_API_KEY]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderkubernetesrepoD69C3A79nametwinepassword_CBAB489F: Refreshing state... [id=cdktf-provider-kubernetes:TWINE_PASSWORD]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfprovidernullrepo8A692B1Dnamenpmtoken_5CD80167: Refreshing state... [id=cdktf-provider-null:NPM_TOKEN]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfprovidernullrepo8A692B1Dnametwineusername_4897131D: Refreshing state... [id=cdktf-provider-null:TWINE_USER_NAME]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfprovidernullrepo8A692B1Dnametwinepassword_1CAAF676: Refreshing state... [id=cdktf-provider-null:TWINE_PASSWORD]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfprovidergooglerepo3D7769E0nametwinepassword_6AF1BFAC: Refreshing state... [id=cdktf-provider-google:TWINE_PASSWORD]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfprovidergooglerepo3D7769E0namenugetapikey_5A6D8D97: Refreshing state... [id=cdktf-provider-google:NUGET_API_KEY]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfprovidergooglerepo3D7769E0nametwineusername_2A935877: Refreshing state... [id=cdktf-provider-google:TWINE_USER_NAME]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfprovidergooglerepo3D7769E0namenpmtoken_FA80209B: Refreshing state... [id=cdktf-provider-google:NPM_TOKEN]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderdockerrepo45A47809nametwinepassword_4BEABCCF: Refreshing state... [id=cdktf-provider-docker:TWINE_PASSWORD]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderdockerrepo45A47809namenugetapikey_67D8E3E2: Refreshing state... [id=cdktf-provider-docker:NUGET_API_KEY]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderdockerrepo45A47809nametwineusername_3C7B5539: Refreshing state... [id=cdktf-provider-docker:TWINE_USER_NAME]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderdockerrepo45A47809namenpmtoken_4DC2E01F: Refreshing state... [id=cdktf-provider-docker:NPM_TOKEN]
github_actions_secret.repos_nugetapikey_secretgithubrepositoryreposcdktfproviderawsrepo55F46B23namenugetapikey_13F9475E: Refreshing state... [id=cdktf-provider-aws:NUGET_API_KEY]
github_actions_secret.repos_twineusername_secretgithubrepositoryreposcdktfproviderawsrepo55F46B23nametwineusername_6DC4CF5D: Refreshing state... [id=cdktf-provider-aws:TWINE_USER_NAME]
github_actions_secret.repos_twinepassword_secretgithubrepositoryreposcdktfproviderawsrepo55F46B23nametwinepassword_56459168: Refreshing state... [id=cdktf-provider-aws:TWINE_PASSWORD]
github_actions_secret.repos_npmtoken_secretgithubrepositoryreposcdktfproviderawsrepo55F46B23namenpmtoken_DEA38761: Refreshing state... [id=cdktf-provider-aws:NPM_TOKEN]
github_team_repository.repos_cdktfrepositorymanager_managingteam_31E92624: Refreshing state... [id=3949435:cdktf-repository-manager]
github_team_repository.repos_cdktfproviderproject_managingteam_86F83671: Refreshing state... [id=3949435:cdktf-provider-project]
github_team_repository.repos_cdktfproviderkubernetes_managingteam_E627D265: Refreshing state... [id=3949435:cdktf-provider-kubernetes]
github_team_repository.repos_cdktfprovidergoogle_managingteam_9604098C: Refreshing state... [id=3949435:cdktf-provider-google]
github_team_repository.repos_cdktfprovidergithub_managingteam_DD2D4282: Refreshing state... [id=3949435:cdktf-provider-github]
github_team_repository.repos_cdktfproviderazurerm_managingteam_C1D890C2: Refreshing state... [id=3949435:cdktf-provider-azurerm]
github_team_repository.repos_cdktfproviderdatadog_managingteam_455152F1: Refreshing state... [id=3949435:cdktf-provider-datadog]
github_team_repository.repos_cdktfproviderrandom_managingteam_94F669F5: Refreshing state... [id=3949435:cdktf-provider-random]
github_team_repository.repos_cdktfprovidernull_managingteam_900A83BC: Refreshing state... [id=3949435:cdktf-provider-null]
github_team_repository.repos_cdktfproviderexternal_managingteam_9DD6F017: Refreshing state... [id=3949435:cdktf-provider-external]
github_team_repository.repos_cdktfproviderdocker_managingteam_F33627F0: Refreshing state... [id=3949435:cdktf-provider-docker]
github_team_repository.repos_cdktfprovideraws_managingteam_FC9AAFD0: Refreshing state... [id=3949435:cdktf-provider-aws]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_team_repository.repos_cdktfproviderdocker_managingteam_F33627F0 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderdocker_managingteam_F33627F0" {
      ~ etag       = "W/\"43b475d8130e1922e35406f3837acadf9086093db033afef7cea03036e2b0656\"" -> "W/\"16af7cf828e2925d746d51700ffb321e7ab984ad73265391e5896b27ceb433dc\""
        id         = "3949435:cdktf-provider-docker"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderexternal_managingteam_9DD6F017 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderexternal_managingteam_9DD6F017" {
      ~ etag       = "W/\"0be07c0a5f37aed300c8f52261e99668383d91ebeb0cd319c28f860c9b60a2ff\"" -> "W/\"e299b2351edf9c7909b7a24d915b8195de960a8fd4c5894eac6cfbdc29fdde36\""
        id         = "3949435:cdktf-provider-external"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderazurerm_managingteam_C1D890C2 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderazurerm_managingteam_C1D890C2" {
      ~ etag       = "W/\"09d027d227f34d6ab7e5c52bd66e1fc6bd87ec06398e2f04218bdfd147201b32\"" -> "W/\"9d44fa1c60982e3411898b1b4d95593eaa60c59e519ea06f5214c7312d02c32c\""
        id         = "3949435:cdktf-provider-azurerm"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovideraws_managingteam_FC9AAFD0 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovideraws_managingteam_FC9AAFD0" {
      ~ etag       = "W/\"b1a9d41148478857ce9df07214b98a2fa457870ca6e0f58cd4f5090349fa9559\"" -> "W/\"e57c940aa2f5e77f1b971b3cc04ba9e1eda944f2a24172bd9fb945506cbcc050\""
        id         = "3949435:cdktf-provider-aws"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderdatadog_managingteam_455152F1 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderdatadog_managingteam_455152F1" {
      ~ etag       = "W/\"a0fa422286f57290bc1797524c528faa41ba86417dcd3034731dca682d004acc\"" -> "W/\"fc6073bfbef3ef1def804b6c7e372dd0612cdce689ea5bf672faad1f9df3d425\""
        id         = "3949435:cdktf-provider-datadog"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderproject_managingteam_86F83671 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderproject_managingteam_86F83671" {
      ~ etag       = "W/\"6bc65ccd3a46cf1ec229437e4fb52dc63bacd0ed2a2e76c6964141dc88e7b67e\"" -> "W/\"dbcedcfe56c72b90e851d2f85b360f00814ca56f4149ab9ca938bb731db7a6a3\""
        id         = "3949435:cdktf-provider-project"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfrepositorymanager_managingteam_31E92624 has been changed
  ~ resource "github_team_repository" "repos_cdktfrepositorymanager_managingteam_31E92624" {
      ~ etag       = "W/\"f14565c7fffa95f7776e79f17a9497197a6cfdfb58373109a35fa312f1930f41\"" -> "W/\"108a612734c0a08e77106892288260da0a8c4cd842cf9a355ee3f2196a321ac7\""
        id         = "3949435:cdktf-repository-manager"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderrandom_managingteam_94F669F5 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderrandom_managingteam_94F669F5" {
      ~ etag       = "W/\"0e91601603d6d3d4a751c143da0db1ef9715666ebb4adcb7c7010c78d450cc03\"" -> "W/\"0cb44a1ec806c99ec465113495a5b0ee38fb20c13962415aaf3c0e72b436d176\""
        id         = "3949435:cdktf-provider-random"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfproviderkubernetes_managingteam_E627D265 has been changed
  ~ resource "github_team_repository" "repos_cdktfproviderkubernetes_managingteam_E627D265" {
      ~ etag       = "W/\"b74b7c3b98aa458ad94451c498d13b38569f1e0af68ec5db7da415c9b315433f\"" -> "W/\"98a2f432f555f6462a322ce844ad1a8d47756141d10e5388e1067f5320e141e7\""
        id         = "3949435:cdktf-provider-kubernetes"
        # (3 unchanged attributes hidden)
    }
  # github_repository.repos_cdktfprovideraws_repo_55F46B23 has been changed
  ~ resource "github_repository" "repos_cdktfprovideraws_repo_55F46B23" {
      ~ etag                   = "W/\"e1a37128b70f3e366b7f76a784853dc029ea8603abee8da8a0f29f6891ed07f8\"" -> "W/\"bb4dc4dd258a036f2c8b72106fe1e09b195dfc0fdeb0abcc2d6f586614f12472\""
        id                     = "cdktf-provider-aws"
        name                   = "cdktf-provider-aws"
        # (26 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidergithub_managingteam_DD2D4282 has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidergithub_managingteam_DD2D4282" {
      ~ etag       = "W/\"180cf9b367d648f67537099d8fdc07c8395d40cb76695c74ea273fe1090678e6\"" -> "W/\"c545f3a18d461b2da1bf7c0c76b3da3a0aecdba532b18f58d93667d050cf88e2\""
        id         = "3949435:cdktf-provider-github"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidergoogle_managingteam_9604098C has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidergoogle_managingteam_9604098C" {
      ~ etag       = "W/\"e80ece87ed0d3b2354276d78172c3a2b6d8b0e5327a946054eb076191a7ca781\"" -> "W/\"4226e96f099ddea7587921b8f767cba5c509e2ddaf40df90563235b774ccc0b4\""
        id         = "3949435:cdktf-provider-google"
        # (3 unchanged attributes hidden)
    }
  # github_team_repository.repos_cdktfprovidernull_managingteam_900A83BC has been changed
  ~ resource "github_team_repository" "repos_cdktfprovidernull_managingteam_900A83BC" {
      ~ etag       = "W/\"d5199da52104943b1fa484845627e803c6afd3bb1ae0c1cb75ac3c767724622f\"" -> "W/\"fabd94b8bb61c9fca0034d0be0765c206e3befc782571e400dfeba7aea37f929\""
        id         = "3949435:cdktf-provider-null"
        # (3 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderawsrepo55F46B23nameghtoken_3B17187D will be created
  + resource "github_actions_secret" "repos_ghtoken_secretgithubrepositoryreposcdktfproviderawsrepo55F46B23nameghtoken_3B17187D" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-aws"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderazurermrepo19E06DC3nameghtoken_1ECFC94A will be created
  + resource "github_actions_secret" "repos_ghtoken_secretgithubrepositoryreposcdktfproviderazurermrepo19E06DC3nameghtoken_1ECFC94A" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurerm"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderdatadogrepo3C8DEE00nameghtoken_ADF9D40A will be created
  + resource "github_actions_secret" "repos_ghtoken_secretgithubrepositoryreposcdktfproviderdatadogrepo3C8DEE00nameghtoken_ADF9D40A" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-datadog"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderdockerrepo45A47809nameghtoken_1CA966DB will be created
  + resource "github_actions_secret" "repos_ghtoken_secretgithubrepositoryreposcdktfproviderdockerrepo45A47809nameghtoken_1CA966DB" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-docker"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderexternalrepo2177D259nameghtoken_CD932FAF will be created
  + resource "github_actions_secret" "repos_ghtoken_secretgithubrepositoryreposcdktfproviderexternalrepo2177D259nameghtoken_CD932FAF" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-external"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfprovidergithubrepo66B8E54Anameghtoken_6E9D5372 will be created
  + resource "github_actions_secret" "repos_ghtoken_secretgithubrepositoryreposcdktfprovidergithubrepo66B8E54Anameghtoken_6E9D5372" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-github"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfprovidergooglerepo3D7769E0nameghtoken_A7BAAE81 will be created
  + resource "github_actions_secret" "repos_ghtoken_secretgithubrepositoryreposcdktfprovidergooglerepo3D7769E0nameghtoken_A7BAAE81" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-google"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderkubernetesrepoD69C3A79nameghtoken_5AAD8445 will be created
  + resource "github_actions_secret" "repos_ghtoken_secretgithubrepositoryreposcdktfproviderkubernetesrepoD69C3A79nameghtoken_5AAD8445" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-kubernetes"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfprovidernullrepo8A692B1Dnameghtoken_E575EEAE will be created
  + resource "github_actions_secret" "repos_ghtoken_secretgithubrepositoryreposcdktfprovidernullrepo8A692B1Dnameghtoken_E575EEAE" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-null"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.repos_ghtoken_secretgithubrepositoryreposcdktfproviderrandomrepo448077DEnameghtoken_4BBD15CB will be created
  + resource "github_actions_secret" "repos_ghtoken_secretgithubrepositoryreposcdktfproviderrandomrepo448077DEnameghtoken_4BBD15CB" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-random"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

Plan: 10 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "github-token" but a
│ value was found in file "/terraform/terraform.tfvars". If you meant to use
│ this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
```

</details>

*Pusher: @skorfmann, Action: `pull_request`, Working Directory: ``, Workflow: `Repository Manager`*